/**
 * Created by theblackcat on 12/5/17.
 */
public class ThingToDO {

    // 保守估計剩下約三星期時間，下星期天至少需要完成到第5項

    // 空氣方面先暫定是整個世界的氧氣含量
    // 二氧化碳也是

    // 水方面先暫定將開採冰塊為方向 QAQ

    // TODO 1. ＊＊讓熊會依附在地表上移動、跌落、爬樓梯
    // TODO 2. ＊ 實現多層繪圖過程： 繪製地形 －》 繪製建築 －》 繪製形狀  ZhiRui
    // TODO 3. ＊＊＊實現遊戲基本邏輯 ：熊擁有生生命、能開採礦物、能命令熊移動
    // TODO 4. ＊＊ 擴充熊數量： 單隻變三隻
    // TODO 5. ＊ 實現滑鼠右擊物體有選單 ：點擊熊能讓現在控制該隻熊
    // TODO 6. ＊＊ 實現遊戲儲存 ： 將地圖、位置、數據儲存
    // TODO 7. ＊ 完成基本建築功能 ： 食物產生器、
    // TODO 8. ＊＊＊ 完成複雜建築功能 ： 氧氣產生器、研究桌面
    // TODO 9. ＊＊＊遊戲世界擁有基本運作模型 ：放任熊不動，氧氣會自動消耗或食物消耗死掉
    // TODO 10. ＊ 熊能進行研究科技樹功能
    // TODO 12. ＊ 讓地圖能擴張，且使用方向鍵能移動視窗
    // TODO 11. ＊＊＊＊＊＊模擬液體＊＊＊＊＊＊（超難）
    // TODO 12. ＊＊＊＊＊＊將液體元素嵌入遊戲中 (呃）

    //  ＊ 難度等級
    // 在後方放置名字表示認領該功能開發
}
